# Explorative Data Analysis
Explorative Data Analysis (EDA) is a technique based on the human characteristic of visual pattern recognition.

The purpose of EDA is simple: learn more about data by visualizing it in different ways.

> “Exploratory data analysis is graphical detective work.” - John W. Tukey, considered the founder of EDA

## Get Overview of Data
A first step is getting an overview of the whole data set and specific series of it.

In [19]:
import pandas as pd

df = pd.read_csv("https://github.com/hslu-ige-laes/edar/raw/master/sampleData/flatElectricity.csv",
                 sep = ";")

In [3]:
df

                      time  FlatA_Ele  FlatB_Ele  FlatC_Ele  FlatD_Ele
0      2018-11-30 23:45:00   5619.889   7246.254   5125.006   8387.030
1      2018-12-01 00:00:00   5619.904   7246.551   5125.039   8387.085
2      2018-12-01 00:15:00   5619.929   7246.753   5125.077   8387.137
3      2018-12-01 00:30:00   5619.952   7246.933   5125.117   8387.181
4      2018-12-01 00:45:00   5619.973   7247.005   5125.153   8387.222
...                    ...        ...        ...        ...        ...
52605  2020-05-31 23:00:00  10467.960  12040.055   8335.662  13832.386
52606  2020-05-31 23:15:00  10467.966  12040.098   8335.702  13832.429
52607  2020-05-31 23:30:00  10467.972  12040.122   8335.733  13832.477
52608  2020-05-31 23:45:00  10467.985  12040.150   8335.755  13832.517
52609  2020-06-01 00:00:00  10468.004  12040.176   8335.790  13832.551

[52610 rows x 5 columns]

In [7]:
df.head(3)

                  time  FlatA_Ele  FlatB_Ele  FlatC_Ele  FlatD_Ele
0  2018-11-30 23:45:00   5619.889   7246.254   5125.006   8387.030
1  2018-12-01 00:00:00   5619.904   7246.551   5125.039   8387.085
2  2018-12-01 00:15:00   5619.929   7246.753   5125.077   8387.137

In [8]:
df.tail(2)

                      time  FlatA_Ele  FlatB_Ele  FlatC_Ele  FlatD_Ele
52608  2020-05-31 23:45:00  10467.985  12040.150   8335.755  13832.517
52609  2020-06-01 00:00:00  10468.004  12040.176   8335.790  13832.551

In [9]:
df.shape

(52610, 5)

In [17]:
df.dtypes

time          object
FlatA_Ele    float64
FlatB_Ele    float64
FlatC_Ele    float64
FlatD_Ele    float64
dtype: object

> Hint: an objects normally points to unclean data, e.g. the time which should be a datetime object

## Names

In [10]:
df.columns

Index(['time', 'FlatA_Ele', 'FlatB_Ele', 'FlatC_Ele', 'FlatD_Ele'], dtype='object')

## Descriptive Statistics

In [18]:
df.describe()

          FlatA_Ele     FlatB_Ele     FlatC_Ele     FlatD_Ele
count  50589.000000  51893.000000  51894.000000  51873.000000
mean    7963.461884   9750.414189   6592.128982  11025.001172
std     1404.320109   1402.263150    895.101293   1502.320746
min     5619.889000   7246.254000   5125.006000   8387.030000
25%     6833.084000   8575.643000   5809.798250   9782.384000
50%     7828.051000   9700.237000   6594.644500  10962.363000
75%     9218.736000  10997.148000   7317.123000  12253.393000
max    10468.004000  12040.176000   8335.790000  13832.551000